kizua_mwangola/part_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-02 Fri 09:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kizua Mwangola: Part 2: The Lion's Den</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Kizua Mwangola: Part 2: The Lion's Den</h1>
<p>
<a href="index.html">Back to chapter index.</a>
</p>

<p>
Thursday, November 19, 2009
</p>

<p>
Alvalade is the home of Sporting Lisbon, the mighty lion of Portuguese
football. And now, its also the key to my future&#x2026;
</p>

<hr />

<p>
As promised, the day started early, with a trip to Alvalade's
Conservatoria. However, it was just my luck that it had burnt down in
a fire recently. Oscillating between hope and despair &#x2014; have they lost
my entry? can we create a new one? &#x2014; we wondered down to the abandoned
shop window to read a notice: the conservatoria had migrated, lock
stock and smoking barrels (literally) to a different place. Luckily,
it was only up the road, next to the Sonangol pumps by the national
radio station.
</p>

<p>
To our great displeasure, the new place was nothing like the ordered
chaos of Kinaxixe. Here we had sheer, unabated, uncontained
disorganised chaos. After watching some great examples of Angolan
queueing (surely an oxymoron if I ever seen one), I managed to
sneakily speak to a worker. She dutifully told me that archive
searches were not one of their set tasks; I should know to which
conservatoria I belong, and that's that. If I truly wanted to conduct
a search, I could wait two weeks for the new IT system that was being
installed.
</p>

<p>
Well, we couldn't wait two weeks &#x2014; half of our visas!! &#x2014; nor did I
have any belief in time scales for software development &#x2014; Angolan's
or otherwise, worked on far too many of these critters to have any
faith left &#x2014; so we gave up and decided to go for breakfast. I badly
needed my morning coffee to regain my strength. God had, of course,
very different ideas. An hour walk revealed nothing that could vaguely
resemble a cafe and Shahin boycotted all street vendors so, in
addition to all our troubles, starvation now beckoned.
</p>

<p>
We considered our options in a quiet shade under my baptism church. As
if sensing our despair, just there and then our friend L decided to
ring us. A lawyer! Surely a sign. She didn't know off the top of her
head whether there were any other conservatorias in Alvalade, but she
would check; in the mean time, we were to ring Portugal and try to
rinse out more details. Shahin also thought we should consult the
padre and see if we can get any additional info from him.
</p>

<p>
As we queued up to see the padre, we met another couple that were in
almost exactly the same situation as us: a Scottish girl was trying to
marry an Angolan chap, R, but they were struggling in both Britain and
Angola. The coincidence was so amazing it felt uncanny. We chatted for
a bit and traded war stories, commiserating each other. R told us he
had had a lot of problems getting his birth certificate, and one of
the most important things is knowing the location of one's entry in
the registry. This was to be a vital detail.
</p>

<p>
In the end, all our sources came together:
</p>

<ul class="org-ul">
<li>The church archives did not know where I was registered, but they
knew the exact location (book, page, etc.) of my entry in it; thanks
to R, we appreciated the importance of this vital information.</li>
<li>My uncle knew where we were registered, and L confirmed that there
was only one conservatoria in Alvalade. We also found my cousin's B
entry in the church archive, and it mentioned the conservatoria (but
regrettably, not the location of his book in the archives!).</li>
</ul>

<p>
Great dectective work. Now all we need is to request the documents on
Monday.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="part_1.html">Back to previous chapter</a></td>
<td class="org-left"><a href="index.html">Back to chapter index.</a></td>
<td class="org-left"><a href="part_3.html">Forward to next chapter</a></td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-04-02 Fri 09:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
